/** Элемент <input> может быть отображен различными путями, в зависимости от атрибута type. */

/**

 <form>

 <input type="text" name="form_input">

 </form>

 */

/**

button - кнопка

checkbox -Флажки. Позволяют выбрать более одного варианта из предложенных.

file - Поле для ввода имени файла, который пересылается на сервер.

hidden - Скрытое поле. Оно никак не отображается на веб-странице.

image - Поле с изображением. При нажатии на рисунок данные формы
отправляются на сервер.

password - Обычное текстовое поле, но отличается от него тем, что все символы
показываются звездочками. Предназначено для того, чтобы никто не подглядел вводимый пароль.

radio - Переключатели. Используются, когда следует выбрать один вариант
из нескольких предложенных.

reset - Кнопка для возвращения данных формы в первоначальное значение.

submit - Кнопка для отправки данных формы на сервер.

text - Текстовое поле. Предназначено для ввода символов с помощью клавиатуры.

*/

// Семантическая верстка подразумевает использование специальных HTML-элементов с определенной ролью —
// вместо <input type="button"> — <button>,
// вместо <div class="navigation"> — <nav> и так далее.

/** Они однозначно описывают свой смысл или назначение как для браузеров, так и для веб-разработчиков. */
